# ISA 414 - Managing Big Data
## Lecture 4 - Preliminaries (Part III): Advanced Variable Types

#### Slide 6

In [3]:
# first example
my_first_list = ["Paul", "John", "Ringo", "George"]
print(my_first_list)

['Paul', 'John', 'Ringo', 'George']

In [4]:
# second example
my_second_list = ["Paul", 1, "John", True, "Ringo", 2.0, "George"]
print(my_second_list)

['Paul', 1, 'John', True, 'Ringo', 2.0, 'George']

In [5]:
# third example
len(my_second_list)

7

#### Slide 7

In [6]:
# first example: accessing the *third* element of a list
print(my_second_list[2])

John

In [7]:
# second example
print(my_second_list[-1])

George

#### Slide 8

In [8]:
# first code
my_second_list[0:6:2]

['Paul', 'John', 'Ringo']

In [9]:
# second code
my_second_list[0:]

['Paul', 1, 'John', True, 'Ringo', 2.0, 'George']

In [10]:
# third code
my_second_list[:5]

['Paul', 1, 'John', True, 'Ringo']

#### Slide 9

In [11]:
# first code
my_second_list.append("ISA 414")

In [12]:
# second code: the argument 0 means inserting the element at position 0. The old elements are moved to the right
my_second_list.insert(0, "first element")

In [13]:
# third code
my_third_list = my_first_list + my_second_list

#### Slide 10

In [14]:
# first code
my_third_list.remove("Paul")

In [15]:
# second code: removing the first element of the list
my_third_list.pop(0)

'John'

#### Slide 11

In [16]:
# first code
for x in my_third_list:
    print(x)

Ringo
George
first element
Paul
1
John
True
Ringo
2.0
George
ISA 414

In [17]:
# second code
for x in range(len(my_third_list)):
    print(my_third_list[x])

Ringo
George
first element
Paul
1
John
True
Ringo
2.0
George
ISA 414

#### Slide 12

In [18]:
my_fourth_list = []
for i in my_third_list:
    if type(i) == str:
        my_fourth_list.append(i)

#### Slide 13

In [19]:
# first code
my_fourth_list = [i for i in my_third_list if type(i) == str]

In [20]:
# second code
another_list = [i if type(i) == str else None for i in my_third_list]

#### Slide 15 - make sure you install pandas first by running *pip install pandas* in the terminal

In [21]:
import pandas

# create a data frame with a single column
# syntax: {"col_1_name": list, "col_2_name":list, ...}
df = pandas.DataFrame({"Col_1":another_list, "Col_2":my_third_list})

# printing df
df

            Col_1          Col_2
0           Ringo          Ringo
1          George         George
2   first element  first element
3            Paul           Paul
4            None              1
5            John           John
6            None           True
7           Ringo          Ringo
8            None            2.0
9          George         George
10        ISA 414        ISA 414

#### Slide 16

In [22]:
# first code
df["Col_1"]

0             Ringo
1            George
2     first element
3              Paul
4              None
5              John
6              None
7             Ringo
8              None
9            George
10          ISA 414
Name: Col_1, dtype: object

In [23]:
# second code
df[["Col_1", "Col_2"]]

            Col_1          Col_2
0           Ringo          Ringo
1          George         George
2   first element  first element
3            Paul           Paul
4            None              1
5            John           John
6            None           True
7           Ringo          Ringo
8            None            2.0
9          George         George
10        ISA 414        ISA 414

#### Slide 17

In [24]:
# first code
df.iloc[:,1]

0             Ringo
1            George
2     first element
3              Paul
4                 1
5              John
6              True
7             Ringo
8               2.0
9            George
10          ISA 414
Name: Col_2, dtype: object

In [25]:
# second code
df.iloc[[0, 2], :]

           Col_1          Col_2
0          Ringo          Ringo
2  first element  first element

#### Slide 18

In [29]:
# first code
df = df.append({"Col_1":1, "Col_2":2}, ignore_index=True)

In [30]:
# second code
df  = df.drop(10)

#### Slide 30

In [1]:
import pandas 
web_data = pandas.read_csv("web_log.csv")
web_data

          City        Client_IP   Country_Name   Latitude   Longitude
0    Singapore  128.199.234.236      Singapore   1.293100  103.855797
1    Singapore  128.199.234.236      Singapore   1.293100  103.855797
2    Singapore  128.199.234.236      Singapore   1.293100  103.855797
3    Singapore  128.199.234.236      Singapore   1.293100  103.855797
4    Singapore  128.199.234.236      Singapore   1.293100  103.855797
..         ...              ...            ...        ...         ...
994    Ashburn     54.227.93.32  United States  39.043701  -77.487503
995    Ashburn     54.227.93.32  United States  39.043701  -77.487503
996    Ashburn     54.227.93.32  United States  39.043701  -77.487503
997    Ashburn     54.227.93.32  United States  39.043701  -77.487503
998    Ashburn     54.227.93.32  United States  39.043701  -77.487503

[999 rows x 5 columns]

#### Slide 31

In [36]:
pandas.value_counts(web_data["City"])

Hyderabad        357
Bangkok          232
Ashburn          146
Singapore         48
Mountain View     36
Shanghai          35
Zhengzhou         22
Beijing           11
Charlotte          3
Guiyang            2
Raleigh            2
Shenzhen           1
Tokyo              1
Guangzhou          1
Tracy              1
Camponogara        1
Name: City, dtype: int64

#### Slide 32

In [39]:
results = pandas.value_counts(web_data["City"])
results
results.to_csv("city_freq.csv")